nxp-mcuxpresso/mcux-sdk/boards/twrkm34z50mv3/project_template/pin_mux.h
/*! @name PORTF4 (number 71), GND
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_CLK_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_CLK_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_CLK_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTF3 (number 70), J22[12]/TWRPI-ADC2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_CS_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_CS_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_CS_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASHPins(void);

/*!
 * @brief
 * UART0 IRDA Select: UART0 selected for IRDA modulation.
 * UART0 TX modulated by XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13].
 */
#define MISC_CTL_UART0IRSEL_0b1 0x01u
/*!
 * @brief UART Modulation Type: TypeB (ANDed) Modulation selected for IRDA */
#define MISC_CTL_UARTMODTYPE_0b1 0x01u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitInfra_RedPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPotentiometerPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTemp_sensorPins(void);

/*! @name PORTB5 (number 16), DS1[2]/LCD_P36
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P36_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P36_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P36_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB3 (number 14), J23[4]/I2C1_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P34_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P34_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P34_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB1 (number 12), DS1[4]/LCD_P32
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P32_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P32_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P32_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB0 (number 9), DS1[5]/LCD_P31
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P31_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P31_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P31_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA2 (number 3), DS1[15]/LCD_P45
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P45_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P45_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P45_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA0 (number 1), GND
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P23_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P23_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P23_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC4 (number 23), DS1[9]/LCD_P43
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P43_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P43_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P43_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB6 (number 17), DS1[13]/LCD_P50
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P50_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P50_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P50_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB4 (number 15), J23[3]/I2C1_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P35_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P35_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P35_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB2 (number 13), DS1[12]/LCD_P33
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P33_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P33_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P33_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA1 (number 2), GND
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P24_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P24_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P24_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA3 (number 4), DS1[17]/LCD_P26
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P26_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P26_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P26_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH4 (number 87), DS1[22]/LCD_P19
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P19_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P19_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P19_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG6 (number 81), J25[22]/UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P13_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P13_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P13_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTI3 (number 94), DS1[26]/LCD_P22
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P22_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P22_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P22_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH5 (number 88), DS1[27]/LCD_P20
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P20_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P20_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P20_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG7 (number 82), J25[24]/UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P14_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P14_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P14_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG2 (number 77), J32[B9]/J9[2]/U4[1]/SPI0_PCS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P9_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P9_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P9_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTG3 (number 78), J32[B7]/J12[1]/U4[6]/SPI0_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P10_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P10_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P10_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG5 (number 80), J32[B11]/J13[2]/U4[2]/SPI0_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P12_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P12_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P12_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

