nxp-mcuxpresso/mcux-sdk/boards/twrkm34z50mv3/project_template/pin_mux.h
/*! @name PORTH0 (number 83), J32[B55]/J32[B56]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P15_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P15_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P15_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH1 (number 84), J32[B57]/J32[B58]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P16_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P16_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P16_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH2 (number 85), J32[B59]/J32[B60]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P17_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P17_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P17_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH3 (number 86), GND
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P18_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P18_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P18_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTI2 (number 93), J32[B23]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P21_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P21_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P21_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG4 (number 79), J32[B10]/J15[1]/U4[5]/SPI0_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P11_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P11_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P11_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA4 (number 5), SW1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P27_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P27_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P27_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA5 (number 6), DS1[18]/LCD_P28
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P28_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P28_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P28_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
